# 列表
# 定义列表 - list
s = [56,90,88,65,90,"A","Hello",True]

print(type(s))


# 访问列表
# 获取
print()
# 正向索引  从0开始
print(s[0])
#反向索引  从-1开始
print(s[-8])
# 修改
s[5] = "abc"
print(s)


# 删除
del s[5]
print(s)



# 遍历
for item in s:
    print(item)



# 总结:
#  查看:list[0]
#  修改:list[0] = "A"
#  删除:del list[3]


#
# 列表-切片
# 语法： 序列数据[开始索引:结束索引:步长]
# 不包含结束索引位置对应的元素(开始索引未指定默认为0；结束索引未指定默认为列表长度(直到列表末尾)；步长未指定默认为1)
# 索引采用正向、反向索引都可以
# 步长是选取间隔，默认步长为1


# 例如
s = ["A","B","C","D","E","F","G","H","I","J"]
print(s[0:5:1])
print(s[:5:])
print(s[:5])
print(s[0:-2:1])
# 可以省略冒号,可以更据默认